**`teams/nomis/windows_server_2022_jumpserver`** terragrunt plan on `pull_request` event [#862](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["jumpserver.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.13/1"
        name                  = "jumpserver"
      ~ tags                  = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.1.5/1"
        name                  = "powershell_core"
      ~ tags                  = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.3/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: prometheus_windows_exporter
            description: Component to install prometheus windows exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.1.3
          +       default: 1.1.4
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - WindowsExporterVersion:
                  type: string
                  default: 0.19.0
                  description: Version of the prometheus-windows-exporter
            phases:
              - name: build
                steps:
                  - name: InstallWMIExporter
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - choco install -y prometheus-windows-exporter.install --version '{{ WindowsExporterVersion }}' --params '"/ListenPort:9100"'
        EOT
      ~ date_created          = "2022-12-23T16:18:59.037Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.3/1" -> (known after apply)
        name                  = "prometheus_windows_exporter"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.1.3" -> "1.1.4" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
        name         = "nomis_windows_server_2022_jumpserver"
      ~ tags         = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ date_created                     = "2023-01-03T16:57:14.789Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2023-02-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-01-03T16:57:14.789Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.5" -> (known after apply) # forces replacement
        name                             = "nomis_windows_server_2022_jumpserver"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.5" -> (known after apply)
      ~ date_created      = "2023-01-03T16:57:13.126Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.5" -> (known after apply)
        name              = "nomis_windows_server_2022_jumpserver"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      - working_directory = "" -> null
        # (3 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.3/1" -> (known after apply) # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-3-5"
        name                          = "nomis_windows_server_2022_jumpserver_0_3_5"
      ~ resource_tags                 = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
            # (15 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.

```
